[
  {
    "id": "chunk_0001",
    "text": "BXTrack Solutions: Employment Basics \n \n \nWelcome to BXTrack Solutions! This document outlines the essential employment policies designed to ensure a smooth \nand productive work environment. It includes key information on employment types, \nrecruitment, workplace conduct, attendance, leave policies, compensation, and more. These policies are important for understanding your role, responsibilities, and rights as \nan employee of BXTrack. This document will be updated periodically to reflect changes in company policy, legal \nrequirements, and operational standards. Please refer to the latest version for the most \ncurrent information."
  },
  {
    "id": "chunk_0002",
    "text": "Version History \nVersion Effective Date Last Edited Last Updated Changes Summary \n 2.0 January 01, 2025 December 30, 2024 December 30, 2024 \n \nThe initial version was \ncreated. 1 | www.bxtrack.com \n\n \nSummary of Sections \n \n \n \n1. Employment Policies \n1.1. Probation and Employment Contract \n1.2. Employment Termination and Notice Period \n1.3. Equal Opportunity Employment Policy \n2. Workplace Conduct and Communication \n2.1. Harassment and Violence Prevention \n2.2. Professional Communication \n2.3. Confidentiality and Data Protection \n2.4 Company Laptop Usage Policy \n3. Attendance and Overtime Policies \n3.1. Office Hours and Attendance \n3.2. Break Timings and Reporting Back \n3.3. Overtime Policy \n4. Leave Policies \n4.1. Paid Vacation Days \n4.2. Sandwich Leave Policy \n4.3. Short Leave \n4.4."
  },
  {
    "id": "chunk_0003",
    "text": "Additional Leave Request \n5. Compensation and Bonus Policies \n5.1. Bonus Policy \n6. Dress Code \n6.1. Dress Code Standards \n7. Conflict of Interest \n7.1. Conflict of Interest Policy\n \n \nNote: While reviewing the document, please ensure to read all sections carefully, especially the \nitalicized ones, as they are mandatory to understand. 2 | www.bxtrack.com \n\n \n \n \n1. Employment Policies \n1.1. Probation and Employment Contract \n● Hiring Process: All new hires receive a written employment contract outlining their role, \nresponsibilities, salary, and benefits. The contract may include a probationary period. ● Probation Period: During probation, the company reserves the right to terminate \nemployment without prior notice. Employees cannot terminate the contract during the \nprobation period."
  },
  {
    "id": "chunk_0004",
    "text": "Additionally, employees on probation are not entitled to any paid leave. ● Post-Probation Period (Full-Time Employment): Once the probation period is \nsuccessfully completed, the employee will transition to full-time employment status with \nthe company. From this point forward, both the employee and the company are required \nto provide a 30-day notice before either party can terminate the employment relationship. 1.2. Employment Termination and Notice Period \n● Employee-Initiated Termination: \nEmployees are required to provide a written notice of 30 \ndays if they intend to resign from their position. Failure to comply with this notice period may \nresult in a deduction equivalent to up to one month’s salary and legal actions in accordance \nwith the labor laws of Pakistan."
  },
  {
    "id": "chunk_0005",
    "text": "● Company-Initiated Layoff & Termination: The company will provide 30 days' notice or \nseverance pay, depending on the situation. Layoff / Termination may occur due to \nperformance issues, misconduct, or organizational changes. ● Final Salary: When an employee’s employment ends, whether through resignation, \nlayoff, or termination, they will receive a final salary. This salary will include wages for \nany work completed up until the employee’s last day, payment for any unused leave \n(such as vacation or sick days), and any other benefits or entitlements outlined in the \nemployment contract. The final salary will be paid in the next payroll cycle, typically at \nthe start of the following month, and will include all dues in one payment \n \n3 | www.bxtrack.com \n\n \n \n \n1.3."
  },
  {
    "id": "chunk_0006",
    "text": "Equal Opportunity Employment Policy \n● Equal Treatment: BXTrack Solutions ensures no discrimination based on gender, age, \nrace, religion, disability, or other protected characteristics. We promote inclusivity and \nprovide reasonable accommodations for disabilities. ● Reporting Incidents: If you experience or witness discrimination, report it to HR \nimmediately. There will be no retaliation for filing complaints. 4 | www.bxtrack.com \n\n \n2. Workplace Conduct and Communication \n2.1. Harassment and Violence Prevention \n● Harassment: Includes sabotage, unwanted advances, discriminatory jokes, rumors, or \ncyberbullying. This behavior will not be tolerated. ● Violence: Any violent behavior should be reported immediately. Violence may result in \ntermination and legal action."
  },
  {
    "id": "chunk_0007",
    "text": "● Sexual Harassment: Sexual harassment is illegal and strictly prohibited. If proven, it will \nresult in immediate termination. BXTrack Solutions reserves the right to take legal \naction against the offender per Pakistan’s laws, specifically the Protection Against \nHarassment of Women at the Workplace Act, 2010. ● Reporting: If you experience or witness any form of harassment or inappropriate \nbehavior, it’s important to take action. If you feel safe and comfortable doing so, you may \nconfront the offender directly in a calm and professional manner. However, if you do not \nfeel safe or prefer not to handle the situation personally, it’s crucial to report the behavior \nto your manager or HR as soon as possible."
  },
  {
    "id": "chunk_0008",
    "text": "We encourage you to come forward, as we \nare committed to providing a supportive and safe environment. Rest assured, all reports \nwill be taken seriously, treated confidentially, and investigated thoroughly. There will be \nno retaliation for reporting, and we are here to support you through the process. 2.2. Professional Communication \n● Language Use : \n○ The English language is compulsory in team channels to maintain clarity and \nprofessionalism. ○ While we encourage using English in other channels, such as random or casual \nchats, occasional use of Urdu is acceptable. ○ Employees are also encouraged to use English in personal chats to minimize \nconfusion and avoid potential conflicts."
  },
  {
    "id": "chunk_0009",
    "text": "5 | www.bxtrack.com \n\n \n● Respectful Interactions: Even during disagreements, maintain professionalism in all \ninteractions. ● Avoid Offensive Language: Employees should avoid slang, offensive language, or \nunprofessional communication in all workplace channels. 2.3. Confidentiality and Data Protection\n \n● Confidentiality: Employees must protect all client data, source code, project files, \nemployee records, screenshots, unique selling propositions (USPs), website URLs, and \nany other proprietary information. Sharing or disclosing this information without proper \nauthorization is strictly prohibited."
  },
  {
    "id": "chunk_0010",
    "text": "Employees are also forbidden from using the client’s \nproject name, logo, project ideas, screenshots, code, USPs, or website URLs on any \nplatform, website, personal profile, resume, CV, or freelancing platform. Any \nunauthorized use of this information for personal or professional gain is not allowed. . ● Experience Sharing: Employees may discuss their technical work experience verbally, \nsuch as during interviews or networking opportunities, but must not disclose any \nclient-specific information. This includes, but is not limited to, the client’s name, logo, \nbusiness domain, project details, source code, screenshots, unique selling propositions \n(USPs), website URLs, or any other proprietary information."
  },
  {
    "id": "chunk_0011",
    "text": "Sharing or discussing such \nsensitive information, whether in person or through any online platforms, including \nfreelancing sites or personal profiles, is strictly prohibited. ● Data Handling: Internal and client data must be stored exclusively on secure, approved \nsystems and accessed only by authorized personnel. Upon contract termination, \nemployees are required to return all company-related data, including client information, \nproject files, and any other proprietary materials, and ensure that their access to \ncompany resources is fully revoked. This includes removing access to any company \nsystems, platforms, or tools that were provided during the employment period."
  },
  {
    "id": "chunk_0012",
    "text": "6 | www.bxtrack.com \n\n \n2.4 Company Laptop Usage Policy \n● Employees provided with a company laptop are expected to use it responsibly and for \nwork-related purposes. Limited personal use is permitted (Not in company profile), \nprovided it does not interfere with work responsibilities or violate company policies. Employees must ensure the laptop’s safety and report any issues, such as malfunctions \nor software problems, to the HR department immediately. Unauthorized software \ninstallation or any modification of system settings is strictly prohibited. ● In the event the laptop is lost, damaged, or rendered non-functional, the employee may \nbe held accountable for repair or replacement costs, depending on the situation."
  },
  {
    "id": "chunk_0013",
    "text": "The \ncompany will evaluate the circumstances to determine if negligence or misuse was \ninvolved. Any loss or theft must be reported promptly to the HR department and \nmanagement. Upon resignation or termination, employees are required to return the \nlaptop in proper working condition, barring normal wear and tear. Failure to comply with \nthese guidelines may result in disciplinary action. 7 | www.bxtrack.com \n\n \n3. Attendance and Overtime Policies \nEmployees are expected to be present and ready to begin work promptly at 9:00 AM. A grace \nperiod of 15 minutes is provided, allowing arrivals until 9:15 AM. Any arrival after 9:15 AM will be \nconsidered late. Consistent punctuality is essential to maintaining a productive and professional \nwork environment."
  },
  {
    "id": "chunk_0014",
    "text": "We encourage all employees to arrive on time and be prepared to start their \nduties by 9:00 AM. Late Arrivals and Salary Deductions: \nThe following salary deductions will apply based on the time of arrival: \n● Arrival between 9:16 AM and 9:30 AM: A 20% deduction of one day's salary. ● Arrival between 9:31 AM and 10:00 AM: A 30% deduction of one day's salary. ● Arrival between 10:01 AM and 11:00 AM: A 45% deduction of one day's salary. ● Arrival after 11:00 AM: A 50% deduction of one day's salary, unless prior approval has \nbeen granted. Reporting Absences: \nIf you need to be absent, please notify your manager and HR as soon as possible. Unreported \nabsences may be excused in cases of medical emergencies or other valid reasons. 3.2."
  },
  {
    "id": "chunk_0015",
    "text": "Break Timings and Reporting Back: Employees are entitled to a break during the day. The break time will be from 1:20 PM to 2:20 PM. Employees must return to work by 2:20 PM, \nwhich is the end of the designated break period. 3.3. Overtime Policy \n● Approval: Overtime must be pre-approved by a manager. Employees cannot work \novertime on their own initiative. ● Overtime Reporting: All overtime hours must be reported to HR on the same day they \nare worked. If overtime is not reported on the same day, the hours will not be \nconsidered, and they will not be included in the salary calculation. 8 | www.bxtrack.com \n\n \n● Compensation: Overtime will be compensated based on your regular hourly rate, \ncalculated according to your monthly salary."
  },
  {
    "id": "chunk_0016",
    "text": "The payment for overtime will be made at \nyour regular hourly rate for any hours worked beyond the standard workweek. 4. Leaves and Vacations \n4.1. Short Leaves \n1. Allowed Short Leaves \nEmployees are allowed a maximum of two short leaves per month, each resulting in a pay \ndeduction. We encourage employees to take short leaves only when absolutely necessary or in \ncases of emergency, to ensure leave availability for urgent situations. 2. Approval Requirement \nShort leaves must be approved by both HR and the Manager before they are taken. Employees \nare expected to request short leaves in advance to ensure that the team can manage any \nimpact on work. 3."
  },
  {
    "id": "chunk_0017",
    "text": "Deductions \n● If an employee takes a short leave before the scheduled break (such as the lunch break) \nand does not return, it will be considered a full-day absence and will count as both of the \nmonthly short leaves. ● If the short leave is taken before the break and the employee returns before the break \nends, or if it is taken after the break, the deduction will be half-day pay. ● If the short leave is for two hours or less, the deduction will be based on the actual hours \nmissed, and it will still count as one of the monthly short leaves. 4. Conclusion \nShort leaves should be used sparingly and only when necessary. Employees should be mindful \nof the impact on their pay and work schedule. Any abuse of the short leave policy may lead to \ndisciplinary action."
  },
  {
    "id": "chunk_0018",
    "text": "If your manager adjusts your hours due to a flexible schedule, it will not be \nconsidered a short leave, but it will affect your hour adjustments. 9 | www.bxtrack.com \n\n \n4.2. Paid Vacation Days \n● Vacation Entitlement: Employees are entitled to 24 paid vacation days per year, divided \nequally across the year as a maximum of 2 leaves per month. These leaves can be used \nfor both sick and casual purposes. ● Unused Vacation Days: \nPaid vacation days must be utilized within the month they are \nallocated. Unused vacation days will not roll over to subsequent months or years. Instead, \nemployees will be compensated with an additional payment equivalent to one day’s salary \nfor each unused vacation day the same month."
  },
  {
    "id": "chunk_0019",
    "text": "● Request Process: \nFor vacation requests exceeding 2 days with a valid reason, employees \nmust submit their requests at least 15 days in advance via email for managerial approval. 4.3. Sandwich Leave Policy \n● Unauthorized Leave: Employees are not allowed to take leave between weekends and \npublic holidays. If they do, the public holiday will be considered unpaid, and no salary will \nbe provided for that off day as well. 4.4. Additional Leave Request: If an employee needs leave beyond their 2 paid leaves in a \nmonth, they must contact HR. The reason for the leave will be reviewed, and approval will be \ngiven based on the situation. 10 | www.bxtrack.com \n\n \n5. Compensation and Bonus Policies \n5.1."
  },
  {
    "id": "chunk_0020",
    "text": "Bonus Policy \n● Performance Bonuses: Performance-based bonuses may be awarded based on \nindividual and company performance metrics. Eligibility and amounts will be determined \nthrough performance reviews.- \n● Target-Based Bonuses: Bonuses may also be tied to achieving specific company-set \ntargets. 6. Dress Code \n6.1. Dress Code Standards \n● Attire: Employees should wear Business, Business Casual, or Smart Casual clothes to \nmaintain a professional appearance, especially during client interactions. Gym wear, \nsweatpants, or overly casual clothing like torn or ripped jeans are not allowed. ● Footwear: Employees should wear appropriate footwear that complements their \nprofessional attire."
  },
  {
    "id": "chunk_0021",
    "text": "● Respect for Individuality: BXTrack respects personal clothing choices influenced by \nreligious beliefs, cultural backgrounds, or disabilities, but all attire should still be suitable \nfor a professional environment. ● General Appearance: Employees should ensure their clothes are neat, clean, and in \ngood condition. Excessive jewelry, strong fragrances, or inappropriate accessories are \ndiscouraged to maintain a professional workplace. 11 | www.bxtrack.com \n\n \n7. Conflict of Interest \n7.1. Conflict of Interest Policy \n● Definition and Examples: A conflict of interest arises when personal activities or \nrelationships interfere with your responsibilities to BXTrack Solutions."
  },
  {
    "id": "chunk_0022",
    "text": "Examples include: \n○ Engaging in freelance work or side projects that could distract from your \nresponsibilities at BXTrack. ○ Having financial interests in competing companies or clients. ○ Personal relationships with colleagues or vendors that may influence \ndecision-making. ● Expectations and Reporting: \n○ Employees must prioritize BXTrack’s interests. ○ Avoid situations that could compromise your performance or focus. ○ Inform your manager if outside work: \n■ Affects your role at BXTrack. ■ Relates to our business. ○ If unsure about an ethical dilemma, consult with your manager or HR for \nguidance. ○ Maintain transparency to ensure a fair and productive workplace."
  },
  {
    "id": "chunk_0023",
    "text": "Appendix: Quick Reference \n● HR Contact: hr@bxtrack.com \n● Office Hours: 9:00 AM to 6:00 PM \n● Vacation Request Process: Submit to HR Manager via email or by Slack \n● Reporting Absences: Notify Manager and HR \n12 | www.bxtrack.com"
  }
]